//
//  xxxx.swift
//  TranslateNumbers
//
//  Created by Joachim Neumann on 12/23/23.
//


/*
https://www.chineseconverter.com/en/convert/arabic-numbers-to-chinese-numbers
6789123 六百七十八万九千一百二十三
6789120 六百七十八万九千一百二十
6789103 六百七十八万九千一百零三
6780023 六百七十八万零二十三
6709123 六百七十万零九千一百二十三
6089123 六百零八万九千一百二十三
6789123 六百七十八万九千一百二十三
6789100 六百七十八万九千一百
6789003 六百七十八万九千零三
6780023 六百七十八万零二十三
6700123 六百七十万零一百二十三
6009123 六百万零九千一百二十三
 
 

 Which one is most natural / correct? A) or B)?
 2_010     A) 二千 零十           B) 二千 零一十
 10_207    A) 一万 零二百 零七     B) 一万 二百 零七
 10_509    A) 一万 零五百 零九     B) 一万 五百 零九
 40_500    A) 四万 五百           B) 四万 零五百
 31_240    A) 三万 一千 二百 四十  B) 三万 一千 二百四十

 7_890_298      A) 七百 八十九万 〇 二百 九十八   B) 七百 八十九万 二百 九十八  C) 七百 八十九万 零二百 九十八
 27_214_000     A) 二千 七百 二十一万            B) 二千 七百 二十一万
 1_200_080_000  A) 十二亿 零八万                B) 十二亿 八万
 6_709_123      A) 六百七十万零九千一百二十三     B) 六百 七十万 九千 一百二十三   C) 六百 七万 九千 一百二十三
 6_700_123      A) 六百七十万零一百二十三        B) 六百 七十万 一百二十三       C) 六百 七万 〇一百二十三
 6_009_123      A) 六百万零九千一百二十三        B) 六百 万 九千一百二十三       C) 六百 万 九千 一百二十三
 6_089_123      A) 六百 〇八万 九千 一百二十三   B) 六百零八万九千一百二十三

 Is this correct?
 123_456_789 一亿 二千 三百 四十五万 六千 七百 八十九
 240_500_000 二亿 四千 零五十万

 Is 兆 (english: one trillion) the same in tranditional chinese, simplified chinese and financial chinese?
*/
